# PolygonSegmentTooShort Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeometryFailures..::..PolygonSegmentTooShort Property
BuiltInFailures..::..GeometryFailures Class See Also
---
Polygon segment too short
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PolygonSegmentTooShort { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PolygonSegmentTooShort As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PolygonSegmentTooShort {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeometryFailures Class
Autodesk.Revit.DB Namespace